Revit 2027 API
BuiltInFailures.MEPFabricationFailures.HangerWidthOutOfRange Property
 The hanger width is too large to show.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HangerWidthOutOfRange { get; }
Public Shared ReadOnly Property HangerWidthOutOfRange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HangerWidthOutOfRange {
	FailureDefinitionId^ get ();
}
static member HangerWidthOutOfRange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace